# horoscope.py

horoscope_parts = {
    "Начало": [
        "Сегодня вас ждет удача во всех начинаниях, будь то работа или личная жизнь. Вас окружает положительная энергия, способствующая достижению ваших целей.",
        "День обещает быть насыщенным событиями и эмоциями, дарящими вам незабываемые впечатления. Готовьтесь к приятным сюрпризам и интересным встречам.",
        "Ожидайте приятных сюрпризов от близких людей, которые порадуют вас и поднимут настроение. Ваше окружение старается сделать этот день особенным для вас.",
        "Ваши усилия начнут приносить плоды, и вы почувствуете, что все ваши старания были не напрасны. Ваш труд будет вознагражден приятными результатами.",
        "Сегодня вы почувствуете прилив сил и вдохновения, что поможет вам реализовать свои замыслы. Возможно, вы найдете новые способы решения старых проблем.",
        "Этот день принесет вам множество возможностей, которые стоит использовать для достижения своих целей. Будьте готовы к новым вызовам и открытиям.",
        "Сегодня вам предстоит важное открытие, которое изменит ваше представление о мире. Приготовьтесь к новым идеям и познаниям.",
        "Вы находитесь на пороге больших перемен, которые приведут вас к новым успехам и свершениям. Ваша жизнь начинает новую главу, полную возможностей и перспектив.",
        "Этот день станет началом нового этапа в вашей жизни, наполненного радостью и перспективами. Будьте открыты к изменениям и готовы к новым возможностям."
    ],
    "Середина": [
        "Будьте внимательны к мелочам, которые могут сыграть важную роль в вашем успехе. Иногда маленькие детали определяют большие результаты.",
        "Постарайтесь избегать конфликтов и сохранять спокойствие в любых ситуациях, даже самых сложных. Ваше спокойствие будет вашим лучшим союзником.",
        "Открывайте новые возможности и не бойтесь выходить из зоны комфорта, чтобы достигнуть большего. Развивайтесь и растите вместе с новыми вызовами.",
        "Слушайте свою интуицию и не игнорируйте внутренние позывы, которые могут привести вас к верным решениям. Ваш внутренний голос знает, что для вас лучше всего.",
        "Уделяйте внимание здоровью и эмоциональному благополучию, чтобы сохранить баланс в жизни. Забота о себе — залог вашей успешной жизни.",
        "Не забывайте про свои давние мечты и стремитесь к их осуществлению, несмотря на преграды. Ваша мечта — ваша сила и движущая сила.",
        "Помните о важности отдыха и восстановления сил, чтобы не переутомиться и оставаться продуктивными. Дайте себе время отдохнуть и насладиться моментом.",
        "Обращайте внимание на знаки судьбы и следуйте им, они могут указывать вам верное направление. Иногда всё, что вам нужно — это прислушаться к сигналам судьбы.",
        "Не бойтесь принимать нестандартные решения, которые могут открыть перед вами новые горизонты. Иногда именно неожиданные шаги приводят к великим результатам."
    ],
    "Конец": [
        "И все сложится наилучшим образом, даже если это не сразу будет очевидно, главное – верить в себя.",
        "И день принесет вам радость и удовлетворение от проделанной работы, оставив приятные воспоминания.",
        "И успех будет на вашей стороне, а вы почувствуете удовлетворение от достигнутых целей и преодоленных препятствий.",
        "И это откроет для вас новые горизонты и перспективы, о которых вы раньше не подозревали.",
        "И в итоге вы обретете гармонию и внутреннее спокойствие, которые будут вас вдохновлять на новые достижения.",
        "И это приведет вас к долгожданной цели, к которой вы так долго шли, несмотря на все трудности.",
        "И вы сможете насладиться плодами своего труда, получив заслуженное признание и награды.",
        "И это принесет вам множество позитивных эмоций, которыми вы сможете поделиться с близкими.",
        "И вы ощутите прилив энергии и энтузиазма для новых свершений, которые не заставят себя ждать."
    ]
}

zodiacs = {'Овен' : 'images/zodiacs/0.jpg',
           'Телец' : 'images/zodiacs/1.jpg',
           'Близнецы' : 'images/zodiacs/2.jpg',
           'Рак' : 'images/zodiacs/10.jpg',
           'Лев' : 'images/zodiacs/3.jpg',
           'Дева' : 'images/zodiacs/4.jpg',
           'Весы' : 'images/zodiacs/5.jpg',
           'Скорпион' : 'images/zodiacs/6.jpg',
           'Змееносец' : 'images/zodiacs/12.jpg',
           'Стрелец' : 'images/zodiacs/7.jpg',
           'Козерог' : 'images/zodiacs/8.jpg',
           'Водолей' : 'images/zodiacs/11.jpg',
           'Рыбы' : 'images/zodiacs/9.jpg',
           }